#include <iostream>

// 20221111 숙제, 아래 값들 확인해보기 
// int 가 표현할 수 있는 최대범위 알아보기 

int main()
{
    // 1
    int iValue  = 0b00000000000000000000000000000001;

    // 2 
    int iValue1 = 0b00000000000000000000000000000010;
    
    // 2147483647 
    // int가 표현할 수 있는 양수의 최대값 
    int iValue2 = 0b01111111111111111111111111111111;
    
    // -1 
    int iValue3 = 0b11111111111111111111111111111111;

    // -2147483648
    // int가 표현할 수 있는 음수의 최대값 
    int iValue4 = 0b10000000000000000000000000000000;
    
    // int가 표현할 수 있는 최대범위 
    // -2147483648 ~ 2147483647

    return 0;
}
